In [1]:
# Listing 2-1: Example of dictionary syntax

import pandas as pd
account_info = pd.DataFrame({
    "name": ["Bob", "Mary", "Mita"],
    "account": [123846, 123972, 347209],
    "balance": [123, 3972, 7209]
})

account_info["name"]

0     Bob
1    Mary
2    Mita
Name: name, dtype: object

In [2]:
account_info["name"] = ["Smith", "Jane", "Patel"]
account_info

    name  account  balance
0  Smith   123846      123
1   Jane   123972     3972
2  Patel   347209     7209